\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> L = [| 1, 2, [|"a", "b", [|true, false|] |] |];
> L[2][2][1];
false
> L[2][2][1] = true;
Warning: the first element of the left-hand side is not an identifier.
This command will have no effect.
> L[2][2] = "c";
Warning: the first element of the left-hand side is not an identifier.
This command will have no effect.
> L[2] = 3;
> L;
[|1, 2, 3|]
\end{Verbatim}
\end{minipage}\end{center}
