\subsection{nop}
\label{labnop}
\noindent Name: \textbf{nop}\\
no operation\\
\noindent Usage: 
\begin{center}
\textbf{nop} : \textsf{void} $\rightarrow$ \textsf{void}\\
\textbf{nop}() : \textsf{void} $\rightarrow$ \textsf{void}\\
\textbf{nop}(\emph{n}) : \textsf{integer} $\rightarrow$ \textsf{void}\\
\end{center}
\noindent Description: \begin{itemize}

\item The command \textbf{nop} does nothing. This means it is an explicit parse
   element in the \sollya language that finally does not produce any
   result or side-effect.

\item The command \textbf{nop} may take an optional positive integer argument \emph{n}. The argument controls how much (useless) integer additions \sollya performs while doing nothing. 
   With this behaviour, \textbf{nop} can be used for calibration of timing tests.

\item The keyword \textbf{nop} is implicit in some procedure
   definitions. Procedures without imperative body get parsed as if they
   had an imperative body containing one \textbf{nop} statement.
\end{itemize}
\noindent Example 1: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> nop;
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 2: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> nop(100);
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 3: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> succ = proc(n) { return n + 1; };
> succ;
proc(n)
{
nop;
return (n) + (1);
}
> succ(5);
6
\end{Verbatim}
\end{minipage}\end{center}
See also: \textbf{proc} (\ref{labproc}), \textbf{time} (\ref{labtime})
