\subsection{simplify}
\label{labsimplify}
\noindent Name: \textbf{simplify}\\
simplifies an expression representing a function\\

\noindent Usage: 
\begin{center}
\textbf{simplify}(\emph{function}) : \textsf{function} $\rightarrow$ \textsf{function}\\
\end{center}
Parameters: 
\begin{itemize}
\item \emph{function} represents the expression to be simplified
\end{itemize}
\noindent Description: \begin{itemize}

\item The command \textbf{simplify} simplifies constant subexpressions of the
   expression given in argument representing the function
   \emph{function}. Those constant subexpressions are evaluated in using
   floating-point arithmetic with the global precision \textbf{prec}.
\end{itemize}
\noindent Example 1: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> print(simplify(sin(pi * x)));
sin(0.314159265358979323846264338327950288419716939937508e1 * x)
> print(simplify(erf(exp(3) + x * log(4))));
erf(0.200855369231876677409285296545817178969879078385544e2 + x * 0.138629436111
98906188344642429163531361510002687205e1)
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 2: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> prec = 20!;
> t = erf(0.5);
> s = simplify(erf(0.5));
> prec = 200!;
> t;
0.5204998778130465376827466538919645287364515757579637000588058
> s;
0.52050018310546875
\end{Verbatim}
\end{minipage}\end{center}
See also: \textbf{simplifysafe} (\ref{labsimplifysafe}), \textbf{autosimplify} (\ref{labautosimplify}), \textbf{prec} (\ref{labprec}), \textbf{evaluate} (\ref{labevaluate})
