\subsection{subpoly}
\label{labsubpoly}
\noindent Name: \textbf{subpoly}\\
restricts the monomial basis of a polynomial to a list of monomials\\

\noindent Usage: 
\begin{center}
\textbf{subpoly}(\emph{polynomial}, \emph{list}) : (\textsf{function}, \textsf{list}) $\rightarrow$ \textsf{function}\\
\end{center}
Parameters: 
\begin{itemize}
\item \emph{polynomial} represents the polynomial the coefficients are taken from
\item \emph{list} represents the list of monomials to be taken
\end{itemize}
\noindent Description: \begin{itemize}

\item \textbf{subpoly} extracts the coefficients of a polynomial \emph{polynomial} and builds up a
   new polynomial out of those coefficients associated to monomial degrees figuring in
   the list \emph{list}. 
    
   If \emph{polynomial} represents a function that is not a polynomial, subpoly returns 0.
    
   If \emph{list} is a list that is end-elliptic, let be j the last value explicitely specified
   in the list. All coefficients of the polynomial associated to monomials greater or
   equal to j are taken.
\end{itemize}
\noindent Example 1: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> p = taylor(exp(x),5,0);
> s = subpoly(p,[|1,3,5|]);
> print(p);
1 + x * (1 + x * (0.5 + x * (1 / 6 + x * (1 / 24 + x / 120))))
> print(s);
x * (1 + x^2 * (1 / 6 + x^2 / 120))
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 2: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> p = remez(atan(x),10,[-1,1]);
> subpoly(p,[|1,3,5...|]);
x * (0.99986632946591986997581285958052433296267358727218 + x^2 * ((-0.330304785
50486126059609343553423613729820606468353) + x^2 * (0.18015929463652346799743775
1178959039617773054102021 + x * ((-0.1217048583218660289061758356493900338519850
05594189e-13) + x * ((-0.85156350833702702996505336803770858918120961559704e-1) 
+ x * (0.139681284176342339364451388757935284353552217389724e-13 + x * (0.208451
141754345616430184477848098809559834125291781e-1 + x * (-0.568101310125794362656
97622426011325584073285588859e-14))))))))
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 3: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> subpoly(exp(x),[|1,2,3|]);
0
\end{Verbatim}
\end{minipage}\end{center}
See also: \textbf{roundcoefficients} (\ref{labroundcoefficients}), \textbf{taylor} (\ref{labtaylor}), \textbf{remez} (\ref{labremez})
