\subsection{subpoly}
\label{labsubpoly}
\noindent Name: \textbf{subpoly}\\
restricts the monomial basis of a polynomial to a list of monomials\\

\noindent Usage: 
\begin{center}
\textbf{subpoly}(\emph{polynomial}, \emph{list}) : (\textsf{function}, \textsf{list}) $\rightarrow$ \textsf{function}\\
\end{center}
Parameters: 
\begin{itemize}
\item \emph{polynomial} represents the polynomial the coefficients are taken from
\item \emph{list} represents the list of monomials to be taken
\end{itemize}
\noindent Description: \begin{itemize}

\item \textbf{subpoly} extracts the coefficients of a polynomial \emph{polynomial} and builds up a
   new polynomial out of those coefficients associated to monomial degrees figuring in
   the list \emph{list}. 
    
   If \emph{polynomial} represents a function that is not a polynomial, subpoly returns 0.
    
   If \emph{list} is a list that is end-elliptic, let be j the last value explicitely specified
   in the list. All coefficients of the polynomial associated to monomials greater or
   equal to j are taken.
\end{itemize}
\noindent Example 1: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> p = taylor(exp(x),5,0);
> s = subpoly(p,[|1,3,5|]);
> print(p);
1 + x * (1 + x * (0.5 + x * (1 / 6 + x * (1 / 24 + x / 120))))
> print(s);
x * (1 + x^2 * (1 / 6 + x^2 / 120))
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 2: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> p = remez(atan(x),10,[-1,1]);
> subpoly(p,[|1,3,5...|]);
x * (0.99986632946592040328652132536050409538651391160625 + x^2 * ((-0.330304785
504865960892883600730397977029229042144598) + x^2 * (0.1801592946365359217685953
20813474326915586468490636 + x * ((-1.964297786963289435097746245587656074800175
64780934e-14) + x * ((-8.5156350833715728695158830917018787444250158509107e-2) +
 x * (2.06623719395609861444362243747042919086289270788633e-14 + x * (2.08451141
75439291212363707070071773605598189816236e-2 + x * (-7.7470162114099758128144148
652481109904179542588989e-15))))))))
\end{Verbatim}
\end{minipage}\end{center}
\noindent Example 3: 
\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> subpoly(exp(x),[|1,2,3|]);
0
\end{Verbatim}
\end{minipage}\end{center}
See also: \textbf{roundcoefficients} (\ref{labroundcoefficients}), \textbf{taylor} (\ref{labtaylor}), \textbf{remez} (\ref{labremez})
